![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

### The Exercise for  Module 11

#### Instruction:  Please write your code after the phrase " ## Your codes begin here:"

#### Q1. Your first task is to read two dataframes from csv files, the first one form the path: ('data/ex20.csv') with the name df1, and the second one from the path: ('data/ex21.csv') with the name df2? Then you will display both dataframes:

Hint1: To read a csv file you will need to use the function pd.read_csv().

Hint2: To display the head of a dataframe you will need to use the function head().

In [1]:
import pandas as pd

# read the first dataframe
## Your codes begin here:

In [2]:
# read the second dataframe
## Your codes begin here:

#### Q2. Merge the above two dataframes (df1 and df2) based on the common column ('id') into a new dataframe named df12? Then display the new dataframe ('df12')?

**Hint1:** To merge two dataframes, you will need the function **pd.merge()**.

In [3]:
## Your codes begin here:

#### Q3. Read a dataset from a csv file with the path ('data/ex22.csv') into a dataframe with the name 'df3' and display its head? 

#### Then read another dataset from a csv file with the path ('data/ex23.csv') into a dataframe with the name 'df4' and display its head?

**Hint1:** To read a csv file you will need to use the function **pd.read_csv()**.

**Hint2:** To display the head of a dataframe you will need to use the function **head()**.

In [4]:
# read the first dataframe
## Your codes begin here:

In [5]:
# read the second dataframe
## Your codes begin here:

#### Q4. Merge or combine the above dataframes (df3 and df4) into one dataframe with the name df34 based on the common column which is ('employee') in the first dataframe and ('name') in the second dataframe? Then display the new dataframe ('df34')?


**Hint1:** To merge two dataframes, you will need the function **pd.merge()**.

**Hint2:** You will need to instruct pandas about the common columns using the arguments (**left_on** and **right_on**).

In [6]:
## Your codes begin here:

#### Q5. Concatenate the two dataframes (frame1 and frame2) which are created in the two code cells below, concatenate them along the row axis into a new dataframe named ('frame3')? Then display the new dataframe ('frame3')?

**Hint1:** Do not forget to run the two code cells below to create the two dataframes.

**Hint2:** To concatenate two dataframes you will need the function **concat()**

In [7]:
# Just run this cell

frame1 = pd.DataFrame({'states': ['California', 'Georgia', 'Florida', 'Arizona'],
                       'population': [40, 10, 21,7]})
frame1

       states  population
0  California          40
1     Georgia          10
2     Florida          21
3     Arizona           7

In [8]:
# Just run this cell

frame2 = pd.DataFrame({'states': ['Hawaii', 'Colorado', 'Indiana', 'Alaska'],
                       'population': [1.5, 10.4, 5.7, 0.7]})
frame2

     states  population
0    Hawaii         1.5
1  Colorado        10.4
2   Indiana         5.7
3    Alaska         0.7

In [9]:
# Concatenate the two dataframes:
## Your codes begin here:

***
# Solutions
***

#### Q1. Your first task is to read two dataframes from csv files, the first one form the path: ('data/ex20.csv') with the name df1, and the second one from the path: ('data/ex21.csv') with the name df2? Then you will display both dataframes:

In [10]:
import pandas as pd

# read the first dataframe
## Your codes begin here:

df1 = pd.read_csv('data/ex20.csv')
df1.head()

   id     name
0   1  Charles
1   2   Joseph
2   3   Robert
3   4  Michael
4   5     John

In [11]:
# read the second dataframe
## Your codes begin here:

df2 = pd.read_csv('data/ex21.csv')
df2.head()

   id  age
0   1   34
1   2   56
2   3   32
3   4   36
4   5   22

#### Q2. Merge the above two dataframes (df1 and df2) based on the common column ('id') into a new dataframe named df12? Then display the new dataframe ('df12')?

In [12]:
## Your codes begin here:

df12 = pd.merge(df1, df2)
df12

   id     name  age
0   1  Charles   34
1   2   Joseph   56
2   3   Robert   32
3   4  Michael   36
4   5     John   22

#### Q3. Read a dataset from a csv file with the path ('data/ex22.csv') into a dataframe with the name 'df3' and display its head? 

#### Then read another dataset from a csv file with the path ('data/ex23.csv') into a dataframe with the name 'df4' and display its head?

In [13]:
# read the first dataframe
## Your codes begin here:

df3 = pd.read_csv('data/ex22.csv')
df3.head()

  employee  Salary
0    James      56
1    David      76
2     John      71
3  Richard      59
4   Steven      61

In [14]:
# read the second dataframe
## Your codes begin here:

df4 = pd.read_csv('data/ex23.csv')
df4.head()

      name  age
0    David   34
1    James   36
2     John   41
3  Richard   29
4   Steven   38

#### Q4. Merge or combine the above dataframes (df3 and df4) into one dataframe with the name df34 based on the common column which is ('employee') in the first dataframe and ('name') in the second dataframe? Then display the new dataframe ('df34')?

In [15]:
## Your codes begin here:

df34 = pd.merge(df3, df4, left_on = 'employee', right_on = 'name')
df34

  employee  Salary     name  age
0    James      56    James   36
1    David      76    David   34
2     John      71     John   41
3  Richard      59  Richard   29
4   Steven      61   Steven   38
5  William      67  William   41

#### Q5. Concatenate the two dataframes (frame1 and frame2) which are created in the two code cells below, concatenate them along the row axis into a new dataframe named ('frame3')? Then display the new dataframe ('frame3')?

In [16]:
# Just run this cell

frame1 = pd.DataFrame({'states': ['California', 'Georgia', 'Florida', 'Arizona'],
                       'population': [40, 10, 21,7]})
frame1

       states  population
0  California          40
1     Georgia          10
2     Florida          21
3     Arizona           7

In [17]:
# Just run this cell

frame2 = pd.DataFrame({'states': ['Hawaii', 'Colorado', 'Indiana', 'Alaska'],
                       'population': [1.5, 10.4, 5.7, 0.7]})
frame2

     states  population
0    Hawaii         1.5
1  Colorado        10.4
2   Indiana         5.7
3    Alaska         0.7

In [18]:
# Concatenate the two dataframes:
## Your codes begin here:

frame3 = pd.concat([frame1,frame2])
frame3

       states  population
0  California        40.0
1     Georgia        10.0
2     Florida        21.0
3     Arizona         7.0
0      Hawaii         1.5
1    Colorado        10.4
2     Indiana         5.7
3      Alaska         0.7

***

<h1 align="center">Thank You</h1> 

***